greet_text = "Hello, World!"
print(greet_text)

# 1. Замените текст в переменной greet_text
greet_text = "Hello, friend!"
print(greet_text)

# 2. Создайте новую переменную с любым текстом
new_text = "Goodbye, friend!"
print(new_text)

# 3. Запишите new_text в greet_text
greet_text = new_text
print(greet_text)

# 4. А теперь мы изменим свойства new_text
new_text += " Wow!"
print(new_text)
